codes = {
    "Гражданский кодекс p1": "https://lex.uz/ru/docs/111181",
    "Гражданский кодекс p2": "https://lex.uz/ru/docs/180550",
    "Уголовный кодекс": "https://lex.uz/ru/docs/111457",
    "Семейный кодекс": "https://lex.uz/ru/docs/104723",
    "Трудовой кодекс": "https://lex.uz/ru/docs/6257291",
    "Административный кодекс": "https://lex.uz/ru/docs/97661",
    "Бюджетный кодекс": "https://lex.uz/ru/docs/2304140",
    "Гражданский процессуальный кодекс": "https://lex.uz/ru/docs/3517334",
    "Конституция": "https://lex.uz/docs/6445147",
    "Уголовно-исполнительный кодекс": "https://lex.uz/ru/docs/163627",
    "Таможенный кодекс": "https://lex.uz/ru/docs/2876352",
    "Экономический процессуальный кодекс": "https://lex.uz/ru/docs/3523895",
    "Жилищный кодекс": "https://lex.uz/ru/docs/106134",
    "Земельный кодекс": "https://lex.uz/ru/docs/149947",
    "Налоговый кодекс": "https://lex.uz/ru/docs/4674893",
    "Кодекс об административном судопроизводстве": "https://lex.uz/ru/docs/3527365"
}